app/controllers/class_seats_controller.rb

SELECT "class_seats".* FROM "class_seats"
---
  def index
    @class_seats = ClassSeat.all

INSERT INTO "class_seats" ("class_name", "price", "food_service", "Seat_type", "leg_room", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @class_seat = ClassSeat.new(class_seat_params)

    respond_to do |format|
      if @class_seat.save

UPDATE "class_seats" SET "class_name" = ?, "updated_at" = ? WHERE "class_seats"."id" = ?  [["class_name", "Economy Plus "], ["updated_at", "2019-06-06 12:42:32.629659"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @class_seat.update(class_seat_params)

SELECT  "class_seats".* FROM "class_seats" WHERE "class_seats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_class_seat
      @class_seat = ClassSeat.find(params[:id])