app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights"
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ?  [["flight_id", 2]]
---
  def index
    @flights = Flight.all
    @open_flights = []
    @closed_flights = []
    @class_seats = []

    @flights.each do |f|
	if f.seats.length >= f.capacity then

INSERT INTO "flights" ("departure", "arrival", "destination", "baggage_allowance", "capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save

UPDATE "flights" SET "capacity" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["capacity", 2], ["updated_at", "2019-06-06 09:32:39.942482"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @flight.update(flight_params)

DELETE FROM "flights" WHERE "flights"."id" = ?  [["id", 1]]
---
  def destroy
    @flight.destroy

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_flight
      @flight = Flight.find(params[:id])